/******************************************************************************/
/* ランダム挨拶プログラム(風邪引き版)
/*
/* 挨拶のやりとりの中で、風邪を引いていると、咳き込んでしまいます。(バグあり)
/*
/* 「Hello!!」→「How are you?」┬「I'm fine!」
/*                              ├「so so」
/*                              └「XXXXXXXXXXX」 ←catch a cold...と言うつもりが咳き込む
/*
/******************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>
#include "hello.h"

#define	DEBUG_PRINT	printf

/******************************************************************************/
/* 応答メッセージを、咳き込んでしまった「X」に上書きする。
/******************************************************************************/
void overwrite( int resp_pattern )
{
	/* 応答パターンの文字列を、喉が痛くて回答出来ない「X」で全て埋める */
	memset( &resp_string[resp_pattern], 'X', (size_t)&resp_string[resp_pattern] );

	return;
}

/******************************************************************************/
/* 応答パターンをランダムに選択する
/******************************************************************************/
void choice( int* resp_pattern )
{
	unsigned int seed;

	/* ランダムシード値を0初期化 */
	memset( &seed, 0x00, sizeof(seed) );

	/* ランダムシード値に時間を設定 */
	seed = time(NULL);

	/* ランダムシードを与える */
	srand( seed );

	/* 応答パターン(0～2)をランダムに選択 */
	*resp_pattern = rand()%3;

	/* 応答パターンが2の時、喉が痛くて回答不能にする */
	if( *resp_pattern == 2 )
	{
		overwrite( *resp_pattern );
	}

	return;
}

/******************************************************************************/
/* ランダム挨拶プログラム
/******************************************************************************/
int main()
{
	/* 初期化 */
	int resp_pattern = 0;

	printf("Hello!!\nHow are you?\n");

	/* 応答パターンを選択 */
	choice( &resp_pattern );

	/* 応答パターンを出力 */
	printf("%s\n", &resp_string[resp_pattern][0] );

    return 0;
}
